FV2604/E_0595.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.2 | 11.12.2025 (urspr. 01.10.2025)
endfooter

title
GPKE

6.17.1: AD: Bestellung einer Änderung von Abrechnungsdaten von LF an NB



end title
:<b>E_0595</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>10: </b> Handelt es sich bei dem Anwendungsfall um eine Bestellung mittels ORDERS?) then (ja)
    if (<b>15: </b> Handelt es sich um eine Bestellung Änderung Netzentgelte aufgrund netzorientierter Steuerungsmöglichkeit?) then (ja)
        if (<b>17: </b> Wurde die Vorlauffrist von mindestens 2 WT vor dem Änderungszeitpunkt eingehalten?) then (ja)
        else (nein)
            :A21;
            note left
                Cluster: keine Änderung der Daten
                Die Frist zur Änderung wurde nicht eingehalten
            endnote
            kill;
        endif
        if (<b>200: </b> Konnte die Bestellung umgesetzt werden?) then (ja)
            :A20;
            note left
                Cluster: Änderung der Daten
                Der Bestellung der Stammdaten konnte zugestimmt werden.
                Hinweis: NB versendet neue Stammdaten
            endnote
            kill;
        else (nein)
            :A99;
            note left
                Cluster: keine Änderung der Daten
                Der Bestellung der Stammdaten konnte nicht zugestimmt werden.
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: offen
            endnote
            kill;
        endif
    else (nein)
        if (<b>30: </b> Handelt es sich um eine Bestellung Änderung Konzessionsabgabe?) then (ja)
            if (<b>40: </b> Ist der Marktlokation zum Zeitpunkt der bestellten Änderung die Sondervertragskunden-KA zugeordnet?
Hinweis: Wenn der Marktlokation zum Zeitpunkt der bestellten Änderung die Sondervertragskunden-KA zugeordnet ist und die Kriterien nach § 2 Abs. 7 KAV wurden nicht erreicht, so ist diese Frage mit „nein“ zu beantworten.) then (ja)
                :A23;
                note left
                    Cluster: keine Änderung der Daten
                    Sondervertragskunden-KA gemäß § 2 Abs. 3 der Konzessionsabgabenverordnung, daher keine Änderung möglich.
                endnote
                kill;
            else (nein)
            endif
            if (<b>50: </b> Ist die Marktlokation von der Konzessionsabgabe befreit?) then (ja)
                :A24;
                note left
                    Cluster: keine Änderung der Daten
                    Änderung nicht möglich, da Marktlokation von Konzessionsabgabe befreit ist.
                endnote
                kill;
            else (nein)
            endif
            if (<b>55: </b> Ist der bestellte Zustand an der Marktlokation bereits vorhanden?) then (ja)
                :A25;
                note left
                    Cluster: keine Änderung der Daten
                    Der gewünschte Zustand ist bereits an der Marktlokation hinterlegt.
                endnote
                kill;
            else (nein)
            endif
            if (<b>60: </b> Bestellt der LF für eine Marktlokation den Wechsel auf eine Schwachlast-Konzessionsabgabe?) then (ja)
                if (<b>65: </b> Möchte der NB die Bestellung der rückwirkenden Änderung der Konzessionsabgabe aufgrund rechtlicher Fristen ablehnen?) then (ja)
                    :A26;
                    note left
                        Cluster: keine Änderung der Daten
                        Eine rückwirkende Änderung wird abgelehnt.
                    endnote
                    kill;
                else (nein)
                endif
                if (<b>70: </b> Lässt die Gerätekonfiguration der Messlokationen der angefragten Marktlokation zum Umsetzungszeitpunkt die separate Erfassung der Energie in den Schwachlastzeiten zu, um die niedrige Konzessionsabgabe für diese Menge abrechnen zu können?) then (ja)
                else (nein)
                    :A27;
                    note left
                        Cluster: keine Änderung der Daten
                        An der Marktlokation kann die Energie in den Schwachlastzeiten nicht zum angefragten Zeitpunkt separat erfasst werden.
                    endnote
                    kill;
                endif
                if (<b>200: </b> Konnte die Bestellung umgesetzt werden?) then (ja)
                    :A20;
                    note left
                        Cluster: Änderung der Daten
                        Der Bestellung der Stammdaten konnte zugestimmt werden.
                        Hinweis: NB versendet neue Stammdaten
                    endnote
                    kill;
                else (nein)
                    :A99;
                    note left
                        Cluster: keine Änderung der Daten
                        Der Bestellung der Stammdaten konnte nicht zugestimmt werden.
                        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                        Nutzungsmöglichkeit Ende: offen
                    endnote
                    kill;
                endif
            else (nein)
            endif
        else (nein)
            if (<b>90: </b> Handelt es sich um eine Bestellung Änderung Bilanzkreis bzw. Jahresverbrauchsprognose?) then (ja)
                if (<b>100: </b> Wurde die Vorlauffrist von mindestens 7 WT vor dem Änderungszeitpunkt eingehalten?) then (ja)
                else (nein)
                    :A22;
                    note left
                        Cluster: keine Änderung der Daten
                        Die Frist zur Änderung von Bilanzkreis oder Jahresverbrauchsprognose wurde nicht eingehalten.
                    endnote
                    kill;
                endif
                if (<b>105: </b> Handelt es sich um eine Bestellung Änderung Bilanzkreis?) then (ja)
                    if (<b>110: </b> Ist der Bilanzkreis zum angegebenen Zeitpunkt in der Regelzone gültig?) then (ja)
                    else (nein)
                        :A28;
                        note left
                            Cluster: keine Änderung der Daten
                            Bilanzkreis nicht gültig.
                        endnote
                        kill;
                    endif
                    if (<b>120: </b> Ist der Bilanzkreis und der erforderliche Zeitreihentyp in der Zuordnungsermächtigung aufgeführt?) then (ja)
                    else (nein)
                        :A29;
                        note left
                            Cluster: keine Änderung der Daten
                            Bilanzkreis und der erforderliche Zeitreihentyp ist in der Zuordnungsermächtigung nicht aufgeführt.
                        endnote
                        kill;
                    endif
                    if (<b>200: </b> Konnte die Bestellung umgesetzt werden?) then (ja)
                        :A20;
                        note left
                            Cluster: Änderung der Daten
                            Der Bestellung der Stammdaten konnte zugestimmt werden.
                            Hinweis: NB versendet neue Stammdaten
                        endnote
                        kill;
                    else (nein)
                        :A99;
                        note left
                            Cluster: keine Änderung der Daten
                            Der Bestellung der Stammdaten konnte nicht zugestimmt werden.
                            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                            Nutzungsmöglichkeit Ende: offen
                        endnote
                        kill;
                    endif
                else (nein)
                endif
            else (nein)
            endif
        endif
    endif
    if (<b>200: </b> Konnte die Bestellung umgesetzt werden?) then (ja)
        :A20;
        note left
            Cluster: Änderung der Daten
            Der Bestellung der Stammdaten konnte zugestimmt werden.
            Hinweis: NB versendet neue Stammdaten
        endnote
        kill;
    else (nein)
        :A99;
        note left
            Cluster: keine Änderung der Daten
            Der Bestellung der Stammdaten konnte nicht zugestimmt werden.
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: offen
        endnote
        kill;
    endif
else (nein)
    if (<b>210: </b> Stimmen alle Stammdaten für Verwendungszeiträume, welche mit „Im System vorhandene Daten“ gekennzeichnet sind, sowie Verwendungszeiträume welche mit „Im System keine Daten vorhanden“ gekennzeichnet sind, mit dem beim Verantwortlichen vorliegenden Stammdaten überein?
Hinweis:
Dies ist für jeden in der Anfrage vorhandenen Verwendungszeitraum jeweils für den gesamten Zeitraum zu prüfen.) then (ja)
        if (<b>220: </b> Sind in der Bestellung der Stammdatenänderung Verwendungszeiträume der Daten mit dem Code „Erwartete Daten“ und / oder „Keine Daten erwartet“ enthalten?) then (ja)
        else (nein)
            :A01;
            note left
                Cluster: keine Änderung der Daten
                Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit: 
                - Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein. 
                - Es wurden keine Stammdaten zur Änderung angegeben. 
                Eine Stammdatenänderung wird nicht versendet.
            endnote
            kill;
        endif
        if (<b>230: </b> Kommt der Verantwortliche zu dem Ergebnis, dass er Änderungen an seinen Stammdaten vornimmt?) then (ja)
            :A02;
            note left
                Cluster: Änderung der Daten
                Der Verantwortliche teilt in dem Bearbeitungstand der Stammdaten mit:
                - Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.
                - Änderungen an den Stammdaten werden vorgenommen. 
                Eine Stammdatenänderung wird versendet.
            endnote
            kill;
        else (nein)
            :A03;
            note left
                Cluster: keine Änderung der Daten
                Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:
                - Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.
                - Änderungen an den Stammdaten werden nicht vorgenommen.
                Eine Stammdatenänderung wird nicht versendet.
            endnote
            kill;
        endif
    else (nein)
        if (<b>240: </b> Sind in der Bestellung der Stammdatenänderung Verwendungszeiträume der Daten mit dem Code „Erwartete Daten“ und / oder „Keine Daten erwartet“ enthalten?) then (ja)
        else (nein)
            :A04;
            note left
                Cluster: Änderung der Daten
                Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit: 
                - Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein. 
                - Es wurden keine Stammdaten zur Änderung angegeben. 
                Eine Stammdatenänderung wird versendet.
            endnote
            kill;
        endif
        if (<b>250: </b> Kommt der Verantwortliche zu dem Ergebnis, dass er Änderungen an seinen Stammdaten vornimmt?) then (ja)
            :A05;
            note left
                Cluster: Änderung der Daten
                Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:
                - Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.
                - Änderungen an den Stammdaten werden vorgenommen. 
                Eine Stammdatenänderung wird versendet.
            endnote
            kill;
        else (nein)
            :A06;
            note left
                Cluster: Änderung der Daten
                Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit: 
                - Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.
                - Änderungen an den Stammdaten werden nicht vornehmen
                Eine Stammdatenänderung wird versendet.
            endnote
            kill;
        endif
    endif
endif

@enduml
